In [1]:
# Seleccionando entradas para Dataframes

import numpy as np
import pandas as pd

In [2]:
lista_valores = np.arange(25).reshape(5,5)

In [3]:
lista_valores

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [5]:
indices = ['i1','i2','i3','i4','i5']

In [6]:
columnas = ['c1','c2','c3','c4','c5']

In [7]:
dataframe = pd.DataFrame(lista_valores, index=indices,columns=columnas)

In [8]:
dataframe

    c1  c2  c3  c4  c5
i1   0   1   2   3   4
i2   5   6   7   8   9
i3  10  11  12  13  14
i4  15  16  17  18  19
i5  20  21  22  23  24

In [9]:
dataframe['c2']

i1     1
i2     6
i3    11
i4    16
i5    21
Name: c2, dtype: int64

In [10]:
dataframe[['c3','c4']]

    c3  c4
i1   2   3
i2   7   8
i3  12  13
i4  17  18
i5  22  23

In [11]:
dataframe[['c2':'c5']]

SyntaxError: invalid syntax (<ipython-input-11-6f84a9fbe620>, line 1)

In [14]:
dataframe[['c2','c3','c5']]

    c2  c3  c5
i1   1   2   4
i2   6   7   9
i3  11  12  14
i4  16  17  19
i5  21  22  24

In [15]:
dataframe['c2'] > 15

i1    False
i2    False
i3    False
i4     True
i5     True
Name: c2, dtype: bool

In [16]:
dataframe[dataframe['c2'] > 15]

    c1  c2  c3  c4  c5
i4  15  16  17  18  19
i5  20  21  22  23  24

In [17]:
dataframe > 20

       c1     c2     c3     c4     c5
i1  False  False  False  False  False
i2  False  False  False  False  False
i3  False  False  False  False  False
i4  False  False  False  False  False
i5  False   True   True   True   True

In [18]:
dataframe.loc['i3']

c1    10
c2    11
c3    12
c4    13
c5    14
Name: i3, dtype: int64

In [20]:
dataframe.loc['i3']['c4'] # para seleccionar por índice

13

In [21]:
# Operaciones sobre series y dataframes

In [22]:
serie1 = pd.Series([0,1,2],index=['a','b','c'])
serie1

a    0
b    1
c    2
dtype: int64

In [23]:
serie2 = pd.Series([3,4,5,6], index=['a','b','c','d'])
serie2

a    3
b    4
c    5
d    6
dtype: int64

In [24]:
serie1 + serie2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

Como la serie 1 no tiene índice _d_ devuelve `NaN`

In [25]:
lista_valores = np.arange(4).reshape(2,2)
lista_valores

array([[0, 1],
       [2, 3]])

In [26]:
indices = list('ab')
indices

['a', 'b']

In [27]:
columnas = list('12')
columnas

['1', '2']

In [28]:
dataframe = pd.DataFrame(lista_valores, index=indices,columns=columnas)

In [29]:
dataframe

   1  2
a  0  1
b  2  3

In [30]:
lista_valores2 = np.arange(9).reshape(3,3)
lista_valores2

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [31]:
indices2 = list('abc')
indices2

['a', 'b', 'c']

In [32]:
columnas2= list('123')
columnas2

['1', '2', '3']

In [33]:
dataframe2 = pd.DataFrame(lista_valores2,index=indices2,columns=columnas2)

In [34]:
dataframe2

   1  2  3
a  0  1  2
b  3  4  5
c  6  7  8

In [36]:
dataframe3 = dataframe+dataframe2
dataframe3

     1    2   3
a  0.0  2.0 NaN
b  5.0  7.0 NaN
c  NaN  NaN NaN

Suma los elementos que coincide y los que no los pone a `null` o `NaN`

In [37]:
dataframe3[dataframe3 >= 0]

     1    2   3
a  0.0  2.0 NaN
b  5.0  7.0 NaN
c  NaN  NaN NaN

> ¿Cómo lo arreglamos?

Con el método _add_:

In [38]:
dataframe.add(dataframe2, fill_value=0)

     1    2    3
a  0.0  2.0  2.0
b  5.0  7.0  5.0
c  6.0  7.0  8.0

Ha rellenado con 0 los valores que no tenia valor en el original (dataframe)

### Ordenar y clasificar series